Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob2sme/facta/skuvlahistorja1/gullich_s.html.tmx
Source language: sme
Languages: nob

source: På norsk
nob: Sámegillii

source: Artihkal girjjis Sámi skuvlahistorjá 1 .
nob: Artikkel i boka Samisk skolehistorie 1 .

source: Guhkkin davvin Dávggáid vuolde - Muittut Sirpmás 1953-62
nob: Guhkin davvin dávggaid vuolde - Minner fra Sirma 1953-62

source: Einar og Sissel Gullichsen , Røros / Plassje 2003 ( Govva : Svein Lund )
nob: Einar og Sissel Gullichsen , Røros / Plassje 2003 ( Foto : Svein Lund )

source: Dáinna bajilčállagiin leaba Einar ja Sissel Gullichsen čohkken muittuid gihppagii maid 1999:s sáddiiga Sirpmá skuvlii .
nob: Under denne tittelen har Einar og Sissel Gullichsen samla sine minner til et hefte som de i 1999 sendte til skolen i Sirma .

source: Sissel r. Muslie riegádii Stanges Hedmárkkus 1928:s ja válddii oahpaheaddjiskuvllaeksámena Hamaris 1950:s .
nob: Sissel f. Muslie blei født i Stange i Hedmark 1928 og tok lærerskoleeksamen på Hamar 1950 .

source: Einar Gullichsen riegádii Ullensakeris Akershusas 1928:s ja válddii oahpaheaddjiskuvllaeksámena 1953:s .
nob: Einar Gullichsen blei født i Ullensaker i Akershus i 1928 og tok lærerskoleeksamen i 1953 .

source: Oahpaheaddji-guovttos barggaiga Finnmárkkus 1953 ’ rájes 1968 ’ rádjái , Sirpmás ja Kárášjogas .
nob: Lærerparet Gullichsen arbeida i Finnmark fra 1953 til 1968 , i Sirma og i Karasjok .

source: Dan maŋŋá fárriiga Plassjii , gos leaba de orron .
nob: Deretter flytta de til Røros , der de har bodd siden .

source: Dát lea oassi gihppagis .
nob: Her følger et utdrag av heftet .

source: Doppe gos leat čállosis oasi guođđán , dan leat merken " ... " .
nob: Der vi har fjerna tekst er det markert med " ... " Samiske navn er endra til gjeldende rettskriving .

source: Buot álggii munno ovdamanniguoktáin Marit ja Bill Aubertain .
nob: Det begynte med våre forgjengere Marit og Bill Aubert .

source: Veaháš ovdalis juovllaid 1952:s čálii Bill mu eaŋgasgiela oahpaheaddjái Oslo oahpaheaddjiskuvllas ja ávžžuhii nuorra náittospára Sirbmái fárret . ...
nob: Litt før jul i 1952 skrev Bill til min engelsklærer på Oslo Lærerskole og utfordret et ungt ektepar til å dra til Sirma . ...

source: Moai válddiime oktavuođa Marit-guoktáin Billain ja oaččuime dakkaviđe guhkes vástádusbreava . ...
nob: Vi tok kontakt med Marit og Bill og fikk med en gang et langt svarbrev . ...

source: Moai Sisseliin leimme leamaš náitosis sullii golbma vahkku go beaivvádagas maŋŋitgeasi bođiime Sirbmái johkafatnasiin .
nob: Sissel og jeg hadde vært gift i ca. 3 uker da vi en vakker , solfylt sensommerdag ankom Sirma i elvebåt .

source: Lemet Johnsen vieččai munno Skiippaguras ja doalvvui johkafatnasiin Fanasgieddái .
nob: Klemet Johnsen hadde hentet oss i Skipagurra og fraktet oss med elvebåt til Båteng .

source: Das beasaime boares guorbmebiillain Geavgŋá guoikkaid meattá ja Bildámii . ...
nob: Derfra kjørte vi med en gammel lastebil forbi strykene i Storfossen og opp til Pildan . ...

source: Mátki čáppa Deanuleagi guvlui lei dego niehku , ja go lahkaneimme Sirpmá , de oinniime olbmuid čoahkkanan miellái munnuide sávvat buresboahtima .
nob: Det ble en eventyrreise for oss oppover den vakre Tanadalen , og da vi nærmet oss Sirma , så vi folk som hadde samlet seg på elvemælen for å ønske oss velkommen .

source: Dát njuorasmahtii munno .
nob: Det gjorde et veldig sterkt inntrykk på oss .

source: Munnos eai lean nu ollu fárrengálvvut mielde , muhto moai dárbbašeimme vovdnaheastta , ja mun muittán bures ahte Henrik-Ánná dat vieččai heastta ja vovnna ja doalvvui munno gálvvuid bráhkkai .
nob: Vi hadde ikke så mye flyttegods med oss , men vi trengte hest og kjerre , og jeg husker godt at det var Anna Eriksen ( Henrik-Anna ) som hentet hest og vogn og kjørte sakene våre til brakka .

source: Dálueamit Ánná Nilsen vuostáiválddii njálgga mállásiin , - guossohii luosa ja dieđusge luopmániid .
nob: Husmor Anna Nilsen tok imot oss med deilig middag , - laks , selvfølgelig og multer .

source: Lei stuorra erohus boahtit govda , šattolaš giliin Østlánddas guorba boaittobeale Sirbmái .
nob: Det var en stor overgang å komme fra de brede , grøderike bygder på Østlandet og til karrige og isolerte Sirma .

source: Moai áddiime maiddái dakkaviđe ahte giellaváttisvuođat šaddet oalle stuorrát , erenoamážit skuvllas .
nob: Vi forsto jo også med en gang at språkproblemene ville bli svært store , særlig på skolen .

source: Muhto moai leimme nuorat ja munnos lei gillilvuohta ja oaivvildeimme ahte galggaime buot buoremusa dahkat mo de dal leažžá .
nob: Men vi var unge og fulle av pågangsmot og mente vi måtte gjøre det beste ut av det .

source: Moai smiehtaime orrut Sirpmás ovtta dahje guokte jagi ja de vuolgit fas máttás .
nob: Vi regnet med at vi skulle bli i Sirma et år eller to og så reise sørover igjen .

source: Unnán diđiime dalle ahte Sirbmá galggai munno nu geasuhit ahte šattai munno ruovttusadjin 1953:s gitta 1962 ’ rádjái , dušše gaskkalduhtton mottiin lohkanjagiin .
nob: Lite visste vi den gang at Sirma skulle få slikt tak på oss at det skulle bli vår hjemplass fra 1953 til 1962 , bare avbrutt av et par studieår .

source: Skuvlabiire
nob: Skolekretsen

source: Sirpmá skuvlabiire lei máŧohis viiddis , muhto ássan lei deatnogátti vađain .
nob: Sirma skolekrets var enorm i utstrekning , men bosetningen var knyttet til slettelandet langs Tana-elva .

source: Riikka goalmmádin stuorámus deatnu lei eallinvuođđun olbmuide geat ledje ássagoahtán Deanuleahkái .
nob: Landets 3. største elv var selve livsnerven for folk som hadde begynt å slå seg til i elvedalen .

source: Dat lei johtolatgeaidnu mii čanai oktii dán guhkedáláš servodaga , ja deanus fidnejedje luosa iežaset atnui ja vuovdimii .
nob: Den var trafikkåren som bandt det langstrakte samfunnet sammen , og det var elva som ga laks for eget bruk og for salg .

source: 1953:s skuvlabiirre viidodat lei Fanasgiettis nuorttabealde gitta Bartii oarjin , ja davás guvlui ledje nohkameahttun duoddarat , jeakkit ja jávrrit .
nob: I 1953 strakte skolekretsen seg fra Båteng i øst til Port i vest , og nordover lå uendelige vidder med fjell , myrer og vann .

source: Go siskkit riikkageaidnu ollii Fanasgieddái ja Bildámii , de dát skuvlabiirre oassi sirdojuvvui Buolbmát biirii .
nob: Da indre riksvei nådde fram til Båteng og Pildan , ble denne delen av skolekretsen overført til Polmak krets .

source: Mu 1972 ’ leksikonas logan ahte Sirpmá biirres ledje su . 240 ássi , muhto ieš Sirpmá vađas orun muitimin ahte orro sullii 100 olbmo 1953:s . ...
nob: I et eget leksikon fra 1972 heter det at Sirma krets hadde ca. 240 innbyggere , men på selve Sirma-sletta mener jeg å huske at det bodde ca. 100 mennesker med smått og stort i 1953 . ...

source: Sirpmá internáhtta ja skuvla
nob: Internatet og skolen i Sirma

source: ( Govva : Einar ja Sissel Gullichsen )
nob: ( Foto : Einar og Sissel Gullichsen )

source: Skuvla
nob: Skolen

source: ... Moai Sisseliin bođiime Sirbmái 1953:s , leimme unnán hárjánan oahpaheaddjit .
nob: ... Sissel og jeg kom til Sirma i 1953 med nokså blanke ark .

source: Sissel gal lei oahpahan golbma jagi , muhto mun bohten njuolgga oahpaheaddjiskuvllas .
nob: Sissel hadde riktignok skolt i 3 år , men jeg kom rett fra lærerskolen .

source: Ii goabbáge munnos dovdan Finnmárkku , ja moai ean diehtán olus maidige sámi kultuvrra birra .
nob: Ingen av oss kjente Finnmark , og vi var nokså uvitende om samisk kultur .

source: Moai ean máhttán ean sánige sámegiela .
nob: Vi kunne ikke et ord samisk .

source: Ja Sirbmá lei eanemus sieiva sámi skuvlabiire olles Norggas .
nob: Og Sirma var den mest ekte samiske skolekretsen i hele Norge .

source: Muhto nugo juo lean dadjan : Moai liikuime hástalusaid duosttuhit ja háliideimme vásihit juoidá mii lei erenoamáš .
nob: Men som sagt tidligere : Vi likte utfordringer og ville gjerne oppleve noe spesielt .

source: Dat guhkes breava maid Bill Aubert čálii munnuide ovdalgo davás vulggiime , dagahii munno ain sáhkkiibun .
nob: Og det lange brevet som Bill Aubert skrev til oss før vi dro oppover , gjorde oss enda mer nysgjerrige .

source: Bill ’ breava muitalii maiddái ollu Sirpmá ja skuvladilálašvuođaid birra .
nob: Brevet fra Bill fortalte også mye om Sirma og om forholdene i skolen .

source: Dát lei munnuide stuorra ávkin .
nob: Dette var til stor hjelp for oss .

source: Moai deaivvadeimme maiddái Máret-guoktáin Billiin Oslos geasset ovdalgo vulggiime .
nob: Vi traff også Marit og Bill personlig i Oslo om sommeren før vi dro .

source: Sudno geažil sáhtiime vuolgit Sirbmái veaháš báikkálaš diehtoseahkain ja ollu ráđiiguin .
nob: Takket være dem kunne vi dra til Sirma med endel lokalkunnskap og mange tips .

source: Giella lei stuorámus váttisvuohta .
nob: Språket var det verste problemet .

source: Nugo Bill muitala iežas breavas , de ii báljo lean oktage gii máhtii dárogiela go skuvlii álge .
nob: Som Bill sier i sitt brev så var det ingen som kunne noe særlig norsk da de begynte på skolen .

source: Muhto Uhcaoabbá , Elle Adriánná , duottarstobus gii lei 6-jahkásaš , máhtii veaháš dárogiela , son lei rabas , hállái ja somá .
nob: Men Ellen Adrianna ( Uhcaoabbá ) på fjellstua som var 6 år , kunne litt norsk , var åpen , meddelsom og morsom .

source: Moai hálaime skuvlastivraovdaolbmuin ja ozaime su beassat álgit skuvlii jagi árabut - veahkehan dihtii munno .
nob: Vi snakket med skolestyrets formann og søkte om at hun kunne begynne et år for tidlig på skolen - for å hjelpe oss .

source: Dát ordnašuvai , ja vuosttaš beaivve rájes leigga Sissel-guovttos Uhcaoappáin priváhtaoahpaheaddjin nubbi nubbái .
nob: Dette gikk i orden , og helt fra første dag ble Sissel og Uhcaoabbá privatlærere for hverandre .

source: Sissel oahpai sámegiela , ja Elle Adriánná oahpai dađistaga eanet dárogiela .
nob: Sissel lærte samisk , og Ellen Adrianna lærte stadig mer norsk .

source: Klássalanjas su geavaheimmet dulkan 1. luohkás .
nob: I klasserommene ble hun benyttet som tolk i l .

source: Muhto oktii gal Sissel mettii issorasat giellamoivvis .
nob: Men en gang gikk Sissel riktig 5 på i språkforvirringen .

source: Rehketdiimmuin galge sii suorpmaiguin lohkat logi rádjái .
nob: I regnetimene skulle de bruke fingrene når de telte til 10 .

source: Sissel geigii bealggi ja jearai : " Mii dát lea ? "
nob: Sissel holdt opp tommelfingeren og spurte ; " Mii dat lea ? "

source: . Oahppit vástidedje nugo duohta leige : " Bealgi " , muhto Sissel jáhkii son lei oahppan suorbmasáni , ja beivviid ja vahkkoviissaid sii lohke belggiid ja dadje : " Mus leat logi bealggi " . Maid son mánát smihtte ?
nob: . Elevene svarte som sant var : Bealgi - altså tommelfingeren , men Sissel trodde hun hadde fått ordet for finger , suorbma , og i dage- og ukesvis telte de tommelfingre og sa " Mus leat logi bealggi " ( Jeg har 10 tommelfingre ) Hva tenkte ungene ?

source: Ja Uhcaoappás lei sihkkarit somá .
nob: Og Uhcaoabbá hadde det sikkert morsomt .

source: Muhtun rehkenastindiimmuid Sirpmáskuvllas háliidii Sissel dahkat somábun , ja attii rosiinnaid maid galge lohkat .
nob: Noen regnetimer i Sirmaskolen skulle gjøres litt koselige , og Sissel ga elevene rosiner , som de skulle telle .

source: Dása gal mánát liikojedje , ja ujus oahppi Unni Utsi jearai Sisselis muhtumin mojunjálmmiid ; " Rivgu , leago fargga rosindiibmu ? "
nob: Dette var populært , og den beskjedne eleven Unni Utsi spurte Sissel etter en tid med et unnselig smil : " Rivgu , lea go farga rosindiibmu ? "

source: " Vuosttas beaivve rájes leigga Sissel guovttos Uhcaoabbáin priváhtaoahpaheaddjin nubbi nubbái .
nob: ( Frøken , er det snart rosintime ? ) " Helt fra første dag ble Sissel og Uhcaoabbá privatlærere for hverandre .

source: Sissel oahpai sámegiela , ja Ellen Adrianna oahpai dađistaga eanet dárogiela .
nob: Sissel lærte samisk , og Ellen Adrianna lærte stadig mer norsk . "

source: ( Govva : Einar Gullichsen )
nob: ( Foto : Einar Gullichsen )

source: 1957:s čađaheimme moai Sisseliin sámegiela eksámena Oslo universitehtas .
nob: I 1957 tok Sissel og jeg eksamen i samisk ved universitet i Oslo .

source: Moai ean oahppan gal hállat nu ollu sámegiela , muhto moai oahpaime sámi giellaoahpa .
nob: Vi lærte ikke å snakke så mye samisk , men vi fikk en bra innføring i hvordan det samiske språket var bygget opp .

source: Dát oahppu nannii munno jáhku ahte sámemánát berrejit oažžut álgolohkanhárjehusa ja - čállinoahpahusa iežaset gillii , ja ahte sii berrejit beassat oahppat dárogiela amasgiellan seamma láhkai go earát ohppet eaŋgasgiela dahje duiskkagiela .
nob: Dette studiet gav oss en sikker overbevisning om at samebarn burde ha sin første lese- og skriveundervisning på sitt eget språk , og de burde få lære norsk som et fremmedspråk liksom man lærer seg engelsk eller tysk .

source: Dán oktavuođas lei miellagiddevaš lohkat maid Bill Aubert čálii dán birra Aftenpostenis juo 1956:s .
nob: I så måte er det interessant å lese hva Bill Aubert skrev om dette i Aftenposten allerede i 1956 .

source: Son oaivvildii seamma .
nob: Han er inne på akkurat de samme tankene .

source: Go juo leat giellaváttisvuođaid birra hállamin , de háliidan namahastit riiddu mii bohcidii Sámelávdegotti evttohusa geažil .
nob: Siden vi er inne på språkproblemer , så vil jeg som snarest nevne den striden som oppsto omkring samekomiteens innstilling .

source: Dát dagahii ollu rieja ja riiddu gielddain .
nob: Den skapte store bølger og mye strid i kommunene .

source: ( Geahča čállosa dán birra dán artihkkala loahpas .
nob: ( Se avskrift etter denne artikkelen .

source: Doaim . )
nob: Red. )

source: Politihkalaš beroštupmi lei oalle stuoris Sirpmás .
nob: Interessen for politikk var forøvrig ganske stor i Sirma .

source: Riikkapolitihkka lei amas go nu unnán ledje radioapparáhtat mas dieđuid livčče ožžon .
nob: Rikspolitikken sto de fleste nokså fjernt siden det var få radioapparater å hente informasjon fra .

source: Eaige lean nu máŋggas geat diŋgojedje aviissaid , ja sii geat dan dahke , diŋgojedje guovlluaviissaid nugo " Finnmarken " ja " Finnmark Tidende " .
nob: Det var heller ikke så mange som abonnerte på aviser , og de som gjorde det , holdt vel helst distriktsaviser som " Finnmarken " og " Finnmark Tidende " .

source: 1953 ’ Stuorradiggeválga movttiidahtii munno čilget ohppiide mo riikka stivrejit ja hálddašit , ja mii loahpaheimmet dán oahpu doaladettiin " suollemas " ja duođalaš válggaid mas oahppit oassádalle .
nob: Inspirert av stortingsvalget i 1953 ble det også gitt elevene mye informasjon om landets styre og stell , og det hele endte opp med at vi avholdt " hemmelige " og høytidelige valg blant elevene .

source: Buot bellodagat ledje válgačoahkkimiin ja lei hui čearggus go galggai jienaid lohkat .
nob: Alle partiene var representert på valgmøter og det var stor spennning ved opptellingene .

source: Mun sáhtán muitalit ahte Bargiidbellodat oaččui measta buot jienaid , ja Tor Regnor Solbakk šattai " stáhtaministtar " Sirpmá skuvllas .
nob: Jeg kan røpe at Arbeiderpartiet fikk nesten alle stemmene , og Tor Regnor Solbakk ble " statsminister " ved Sirma skole .

source: Dát " Stuorradiggi " oktan Ráđđehusain ja stáhtaministariin ožžo doaimmaid ja vuoigatvuođaid skuvllas ja dat adde ohppiide sihke deaŧalaš doaimmaid ja ovddasvástádusa min uhca skuvllaservodagažis . ...
nob: Dette " Stortinget " med Regjering og statsminister fikk oppgaver og rettigheter ved skolen som både ga elevene viktige oppgaver og ansvar i vårt lille skolesamfunn . ...

source: Go mis lei nu guhkes dálvi Sirpmás , de lei lunddolaš ahte oahppit liikojedje čuoigat .
nob: Med den lange vinteren vi hadde i Sirma så var det naturlig at elevene var glad i å gå på ski .

source: Dát dat várra lei Máret-guoktá Billain oaččuhan ohcat Sabetsearvvis Oslos sabehiid skuvlamánáide .
nob: Dette hadde nok satt Marit og Bill på ideen om å søke Skiforeningen i Oslo om å få ski til skolebarna .

source: Moai maiddái válddiime oktavuođa Sabetservviin ja oaččuime dađistaga nu máŋga pára sabehiid ahte ledje doarvái buohkaide .
nob: Vi henvendte oss også til Skiforeningen og fikk etter hvert så mange par ski at det var nok til alle .

source: Sabehiid moai nummarasttiime ja daid ceggiimet fásta sajiide olgofeaskáris .
nob: Skiene ble nummererte og fikk sine faste plasser utvendig på yttergangen .

source: Oahppit fallo čuoigamis ja hállu gilvalit stuorui .
nob: Skiferdighetene økte og lysten til å konkurrere bare vokste .

source: Mis ledje sihke njuiken- , ladnjedallan- ja čierastangilvvut .
nob: Vi lagde konkurranser både i hopp , slalåm og utfor .

source: Mii bovdiimet Buolbmát ja Skiippagura skuvllaid mielde go geaidnu ráhkaduvvui .
nob: Vi inviterte Polmak og Skipagurra skole da veiforbindelsen kom .

source: Maŋŋá oassádallagohte maiddái Njuorggáma , Ohcejoga , Vuovdaguoikka ja Gáregasnjárgga skuvlabiirret .
nob: Senere ble også de finske skolekretsene Nuorgan , Utsjok , Outakoski og Karegasniemi med .

source: Lágidemiid mii juogadeimmet gaskaneamet .
nob: Og arrangementene gikk på omgang .

source: Stuorámus gilvu dollojuvvui Sirpmás 1961:s man oahpaheaddji Magne Hofshagen jođihii .
nob: Det største rennet ble holdt i Sirma i 1961 , under ledelse av lærer Magne Hofshagen .

source: Suoma beale ustibat ledje buktán hirbmat fiinna vuoittuid , muhto sin mielde manne eanaš vuoittut ruovttoluotta Supmii .
nob: De finske vennene hadde veldig flotte premier med seg , men de tok det meste av premiene med tilbake til Suomi .

source: Sii ledje nu olu falit min , muhto Frøydis Guttorm gal birgehalai singuin čierastallamis .
nob: De var så mye flinkere enn oss , men Frøydis Guttorm slo dem i utfor .

source: Dás ferte maiddái čilget ahte máŋga Sirpmá-oahppi eai geavahan čuoigangápmagiid maŋŋečatnosiin , muhto geavahedje nuvttohiid ja ruovdabessodagaid . ...
nob: Men det må også nevnes at mange av Sirma-elevene ikke brukte skisko med bakbindinger , men måtte nøye seg med skaller og tåreimer . ...

source: Ollesolbmuidhárjehallan ja - faláštallan maid šattai eambbo ja eambbo dábálažžan .
nob: Voksentrening og voksenidrett ble det også stadig mer av .

source: Mis ledje faláštallaneahkedat duhkoraddanlanjas , ja muđui čievččaimet spáppa bievlaáigge ja čuoiggaimet dálvet .
nob: Vi hadde gymkvelder i lekerommet , men ellers var det fotball når det var barmark og skiløping om vinteren .

source: Mii álggaheimmet Deanu faláštallansearvvi ja soađaimet guhká faláštallanlihtuin go leimmet searvái bidjan sámegiela nama .
nob: Vi dannet Deadno idrettslag og fikk en lang og kjedelig sak med idrettsforbundet fordi vi hadde gitt laget et samisk navn .

source: Máŋgii lean smiehttan ahte gávdnogo šat dien áigodaga faláštallansearvvi čoahkkingirji gostege . ...
nob: Mange ganger har jeg lurt på om idrettslagets møteprotokoll fra den tida er å finne noen steder . ...

source: Ovdalgo geaidnu bođii 1958:s , de orro ollu oahppit internáhtas .
nob: Før veien kom i 1958 bodde en god del av elevene på internatet .

source: Lohku rievddadii .
nob: Antallet kunne variere .

source: Skuvlajagis 1953/54 ledje mis badjel 60 oahppi skuvllas , ja dáin orro 25:s internáhtas .
nob: I skoleåret 1953/54 hadde vi drøyt 60 elever ved skolen , og 25 av dem bodde på internatet .

source: Mis lei vuorroskuvlaortnet : 1 . - 3. luohkkálaččat vázze moadde vahkku ja dasto bohte sin sadjái 4 .
nob: Det var turskoleordning : 1-3 kl. gikk noen uker og ble så etterfulgt av 4-7 kl .

source: Juohke joavkkus ledje 3 - 4 vuoru skuvlajagis .
nob: . Hver gruppe hadde 3-4 turer i løpet av skoleåret .

source: Lei ollu šlápma ja stuorra vuordámušat go ain lei vuorromolsun .
nob: Det var stor ståhei og store forventninger når vi hadde turskifte .

source: Ohppiid dolvo ruoktot heastasáhtuin .
nob: Elevene ble fraktet hjem pr. hestskyss .

source: Lei duođai somá oaidnit go buot heasttat bohte reagain ja buriid duljjiiguin , ja Issát Pedersen Varsi , Niillas A. Pedersen Varsi , Stuorra-Peđar Varsi , Jovnna Varsi , Piera Holm Varsi , Biret-Niillas Varsi ja máŋggas earát čuččodedje beaskkat badjelis suittehiiguin .
nob: Det var et staslig syn når hestene troppet opp med sleder og gode reinskinnfeller , og pelskledde Isak Pedersen Varsi , Nils A. Pedersen Varsi , Stor-Peder Varsi , John Varsi , Per Holm Varsi , Berit Nilas Varsi m.fl. sto med tømmene .

source: Geasset ja giđđat geavahedje johkafatnasiid sáhtosteapmái .
nob: Sommer og vår var det elvebåtene som var transportmidlet .

source: Muhtumin ledje heajos siivvut go galggaimet vuoru molsut .
nob: Noen ganger var det førefallstid når vi skulle ha turskifte .

source: Dalle bohciidedje váttisvuođat .
nob: Da var det problemer .

source: Jiekŋa ii gierdan , iige lean reahkasiivu .
nob: Isen holdt ikke , og sledeføre var det heller ikke .

source: Mun muittán ahte Leavvajoga oahppit , Odd , Ragnhild , Sven Åge ja Hans Fridtjof , fertejedje guovtti - golmma geardde mannat čuoigga vári badjel , oktiibuot 66 km Leavvajohkii .
nob: Jeg husker det hendte et par-tre ganger at elevene fra Levajok , Odd , Ragnhild , Sven Åge og Hans Fridtjof , måtte gå på ski over fjellet 66 km. til Levajok .

source: Sii várra idjadedje Roavvegiettis dahje Čuđiidguras .
nob: De overnattet vel i Rovagieddi eller Russeskaret ?

source: Muhto sii birgehalle bures ja jovde ruoktot . ...
nob: Men de berget seg bra og kom hjem . ...

source: Go guokte jagi leimme leamaš eret Sirpmás 1955 – 57 áigodagas , de lei imaš vásáhus beassat biillain gitta bráhka lusa .
nob: Etter 2 år borte fra Sirma i 1955-57 var det underlig å kunne kjøre bil helt fram til brakka .

source: Sirbmá ii leat šat dat seamma mii ovdalis lei .
nob: Sirma var ikke helt det samme .

source: Govda geaidnu lei guhkes hávvin ruonas vađa badjel , ja biillat ráhkadedje hirbmat sáttosuova go meattildedje .
nob: Den brede veien lå som et langt sår gjennom den grønne sletta , og bilene virvlet opp en skikkelig støvsky når de passerte .

source: Mu mielas orui ahte olbmot maiddái doapmagohte eanet .
nob: Jeg innbiller meg også at folk fikk det mer travelt .

source: Ja skuvlaservodahkii guoskkai erenoamážit .
nob: Og skolesamfunnet ble skikkelig berørt .

source: Vuorroskuvlaortnet nogai .
nob: Turskoleordningen ble avviklet .

source: Internáhtta heaittihuvvui ja gielda osttii guokte skuvlabusse .
nob: Internatet ble nedlagt og kommunen kjøpte 2 skolebusser .

source: Piera Olsen Sirpmás ja Jovnna Halonen Skiippaguras leigga skuvlabussevuoddjit .
nob: Per Olsen fra Sirma og John Halonen fra Skipagurra ble skolebuss-sjåfører .

source: Dan botta go Einar ja Sissel Gullichsen leigga virgeluomus , bođii geaidnu Sirbmái , ja soai sáhtiiga máhccat biillain ja varas sámegielmáhtuin .
nob: Mens Einar og Sissel Gullichsen var borte med studiepermisjon kom vegen til Sirma og de kunne returnere med bil og ferske samiskkunnskaper .

source: Dálueamit Ánná Nilsen lei Unjárggas eret .
nob: Husmor Anna Nilsen kom fra Nesseby .

source: Son lei leamaš internáhta dálueamit Sirpmás jahkeviissaid .
nob: Hun hadde vært internathusmor i Sirma i en årrekke .

source: Son lei hirbmat ábas bargat ja skihkahii bures buot divššu ja sisaoastimiid .
nob: Hun var meget dyktig og holdt god orden på alt som hadde med forpleining og innkjøp å gjøre .

source: Sus ledje guokte biiggá .
nob: Hun hadde to assistenter med seg .

source: Unjárgalaš Sigrid Mathisen ja gaskanjárgalaš Máret Somby leigga biigán vuosttaš guokte jagi .
nob: Sigrid Mathisen fra Nesseby og Marit Somby fra Mitternes var der de første 2 årene .

source: Dasto álggii sirbmálaš Hilda Varsi ja Brita Mathisen , gii maŋŋá náitalii Toralv Pederseniin .
nob: Siden kom Hilda Varsi fra Sirma og Brita Mathisen , som senere ble gift med Toralv Pedersen .

source: Goappašagat galggašeigga leat oahpes olbmot Sirpmás go nu máŋga jagi oskkáldasat barggaiga skuvlla ja báikkálaš servodahkii ávkin .
nob: Begge skulle være vel kjente i Sirma etter så mange år med trofast arbeid for skole og lokalsamfunn .
